const Rule = () => {
  return (
    <section className="flex overflow-y-auto justify-center items-center w-full h-full">
      <div className="w-3/4 h-full [&_p]:leading-9 [&_h2]:text-teal-300 [&_h2]:text-2xl [&_h2]:my-3}">
        <div className="py-10"></div>
        <div className="pb-20">
          <h2>● 遊戲狀況規範</h2>
          <ol className="list-decimal ml-11">
            <li>
              <p>
                遊戲中如遇本網站網路不穩造成瞬斷或視訊畫面延遲時，玩家可以選擇停止下注或退出遊戲重新登入，如已下注之注單仍視為有效。
              </p>
            </li>
            <li>
              <p>
                遊戲中荷官不慎同時抽出兩張牌，無論掃描與否，荷官都將依正確順序掃描後繼續運行，該局所下注單視為有效。
              </p>
            </li>
            <li>
              <p>
                遊戲中如遇牌型掃描錯誤，或荷官發牌順序錯誤，荷官將立即更正為正確牌型及放牌位置，若荷官無即時發現更正，玩家可選擇是否進行投注，該局所下注單視為有效。
              </p>
            </li>
            <li>
              <p>
                遊戲中若荷官於下注完畢之前，不慎先開牌，無論幾張，該局所下注單視為無效，並結束當靴開始新局。
              </p>
            </li>
            <li>
              <p>
                遊戲中荷官不慎多抽牌(已不需發牌，荷官仍發牌時)，多發的牌若未翻開，該張牌將做為下一局第一張牌，該局所下注單視為有效。
              </p>
            </li>
            <li>
              <p>
                遊戲中如因牌型掃描錯誤或荷官失誤致使以錯誤結果計算時，本網將以正確結果重新計算。
              </p>
            </li>
            <li>
              <p>
                遊戲中因本網站網路、現場設備等，造成遊戲中斷，請您稍候，待恢復後將繼續未完成牌局，該局所下注單視為有效。
              </p>
            </li>
            <li>
              <p>
                本娛樂城所提供之牌路僅供參考，若因國際線路問題或其他因素造成牌路顯示有誤，所有遊戲結果將以視訊開牌及遊戲記錄為主。
              </p>
            </li>
            <li>
              <p>
                遊戲中因遊戲程序出現異常造成遊戲無法繼續時，已開牌之牌局為有效注單，將繼續完成本局，本網將以視訊結果手動計算，而未開牌之牌局將視為無效，不予計算，所有程序將被關閉，並重開程序，開始新局，並公佈該局錄像，以示公正。
              </p>
            </li>
            <li>
              <p>本娛樂城保留一切有爭議事項的修正及最後的決策。</p>
            </li>
            <li>
              <p>
                本娛樂城保留隨時修訂、撤銷或中止任何投注的權力而無須作事先通知，亦無須作任何解釋。
              </p>
            </li>
            <li>
              <p>
                本娛樂城記錄每一項於本網站伺服器內執行的交易及投注功能。若會員提供的資料與本網站資料庫中的資料記錄之間出現了任何聲稱的差異，一切均以本網站資料庫的資料為準。
              </p>
            </li>
            <li>
              <p>
                惡意使用外掛程序以不正當方式取得之點數，所有點數將不予以計算。
              </p>
            </li>
            <li>
              <p>
                會員最多可申請1 個帳號投注，若超過1
                個以上的帳號投注同場牌局，本公司將保留最終的注單審核及刪除權力。
              </p>
            </li>
          </ol>
        </div>
      </div>
    </section>
  )
}

export default Rule
