export const ruleContext = {
  table1: [
    [
      '閒家頭兩張牌合計點數',
      '閒家',
      '莊家頭兩張牌合計點數',
      '莊家',
      '莊家補牌備註'
    ],
    ['0', '必須補牌', '0', '必須補牌', ''],
    ['1', '必須補牌', '1', '必須補牌', ''],
    ['2', '必須補牌', '2', '必須補牌', ''],
    [
      '3',
      '必須補牌',
      '3',
      '必須補牌',
      '若閒家第三張牌補到8，不須補牌，若閒家第三張牌補到0.1.2.3.4.5.6.7.9必須補牌。'
    ],
    [
      '4',
      '必須補牌',
      '4',
      '必須補牌',
      '若閒家第三張牌補到0.1.8.9，不須補牌，若閒家第三張牌補到2.3.4.5.6.7必須補牌。'
    ],
    [
      '5',
      '必須補牌',
      '5',
      '必須補牌',
      '若閒家第三張牌補到0.1.2.3.8.9不須補牌，若閒家第三張牌補到4.5.6.7必須補牌。'
    ],
    [
      '6',
      '不須補牌',
      '6',
      '閒家不補則不須補牌',
      '若閒家第三張牌補到6.7必須補牌，若閒家第三張牌補到0.1.2.3.4.5.8.9不須補牌。'
    ],
    ['7', '不須補牌', '7', '不須補牌', ''],
    ['8', '例牌，即定輸贏', '8', '例牌，即定輸贏', ''],
    ['9', '例牌，即定輸贏', '9', '例牌，即定輸贏', '']
  ]
}
